nxp-mcuxpresso/mcux-soc-svd/MCXA156/MCXA156.xml
              <description>Memory Block Access Control Select for block B</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLBAC0</name>
                  <description>select MBC_MEMN_GLBAC0 access control policy for block B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC1</name>
                  <description>select MBC_MEMN_GLBAC1 access control policy for block B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC2</name>
                  <description>select MBC_MEMN_GLBAC2 access control policy for block B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC3</name>
                  <description>select MBC_MEMN_GLBAC3 access control policy for block B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC4</name>
                  <description>select MBC_MEMN_GLBAC4 access control policy for block B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC5</name>
                  <description>select MBC_MEMN_GLBAC5 access control policy for block B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC6</name>
                  <description>select MBC_MEMN_GLBAC6 access control policy for block B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC7</name>
                  <description>select MBC_MEMN_GLBAC7 access control policy for block B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE6</name>
              <description>NonSecure Enable for block B</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLOWED</name>
                  <description>Secure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTALLOWED</name>
                  <description>Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBACSEL7</name>
              <description>Memory Block Access Control Select for block B</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLBAC0</name>
                  <description>select MBC_MEMN_GLBAC0 access control policy for block B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC1</name>
                  <description>select MBC_MEMN_GLBAC1 access control policy for block B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC2</name>
                  <description>select MBC_MEMN_GLBAC2 access control policy for block B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC3</name>
                  <description>select MBC_MEMN_GLBAC3 access control policy for block B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC4</name>
                  <description>select MBC_MEMN_GLBAC4 access control policy for block B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC5</name>
                  <description>select MBC_MEMN_GLBAC5 access control policy for block B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC6</name>
                  <description>select MBC_MEMN_GLBAC6 access control policy for block B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLBAC7</name>
                  <description>select MBC_MEMN_GLBAC7 access control policy for block B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE7</name>
              <description>NonSecure Enable for block B</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALLOWED</name>
                  <description>Secure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTALLOWED</name>
                  <description>Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding MBACSEL field in this register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
